// ข้อมูลจำลองของนิสิตที่เข้าสู่ระบบ
export const mockCurrentUser = {
    id: "STD-001",
    studentId: "68023403",
    name: "นายแฮมมี่ มหัศจรรย์",
    linkedIn_Profile: "linkedin.com/in/alexmercer", // ไม่ใช่ข้อมูลจริง
    facebook: "facebook.com/alex.m", // ไม่ใช่ข้อมูลจริง
    email_uni: "68023403@up.ac.th", // ใช้เข้าระบบ
    email_personal: "pp@gmail.com", // ไม่ใช่ข้อมูลจริง
    password: "123456",
    avatarUrl: "./img/profile.jpg"
};
// ข้อมูลจำลองสำหรับ รีวิวบริษัทต่างๆ (Mock Reviews)
export const mockReviews = [
    {
        id: "rev-1",
        userId: "STD-001",
        companyId: "2", // ID: 2 คือ บริษัท เก็ตออน เทคโนโลยี
        companyName: "บริษัท เก็ตออน เทคโนโลยี จำกัด",
        position: "Frontend Developer",
        rating: 5,
        detail: "พี่ๆ ในทีมดูแลดีมาก ได้ลงมือเขียนโค้ดจริงๆ ระบบงานเป็นแบบ Agile มีการทำ Daily Scrum ทุกเช้า",
        date: "09 / 09 / 2026",
        authorName: "นายแฮมมี่ มหัศจรรย์"
    },
    {
        id: "mock-rev-1",
        userId: "STD-002",
        companyId: "2", // ID: 2 คือ บริษัท เก็ตออน เทคโนโลยี
        companyName: "บริษัท เก็ตออน เทคโนโลยี จำกัด",
        position: "Business Analyst",
        rating: 4,
        detail: "ได้เรียนรู้การเก็บ Requirement และทำ Document อย่างเป็นระบบ สังคมเพื่อนร่วมงานดีมากครับ แต่อาจจะมีความกดดันช่วงส่งมอบงานนิดหน่อย",
        date: "15 / 08 / 2026",
        authorName: "นายจิตแจ่มใส ปั่นโปรเจค"
    },
    {
        id: "mock-rev-2",
        userId: "STD-003",
        companyId: "5", // ID: 5 คือ บริษัท บานาน่า โคดดิ้ง
        companyName: "บริษัท บานาน่า โคดดิ้ง จำกัด",
        position: "Developer",
        rating: 5,
        detail: "มีการทำ Code Review ทุกอาทิตย์ ทำให้สกิลเขียนโปรแกรมพัฒนาขึ้นเยอะมาก พี่เลี้ยงใจดี ขนมในออฟฟิศเยอะด้วย!",
        date: "20 / 07 / 2026",
        authorName: "นางสาวสาดไปสมาชิก"
    }, {
        id: "mock-rev-3",
        userId: "STD-004",
        companyId: "2", // ID: 2 คือ บริษัท เก็ตออน เทคโนโลยี
        companyName: "บริษัท เก็ตออน เทคโนโลยี จำกัด",
        position: "Business Analyst",
        rating: 4,
        detail: "ได้เรียนรู้การเก็บ Requirement และทำ Document อย่างเป็นระบบ สังคมเพื่อนร่วมงานดีมากครับ แต่อาจจะมีความกดดันช่วงส่งมอบงานนิดหน่อย",
        date: "15 / 08 / 2026",
        authorName: "นายสีสัน ชีวิต"
    },
];
export const rawMockCompanies = [
    {
        id: "1",
        name: "Interfaces Lab สำนักวิชาวิทยาศาสตร์และเทคโนโลยีสารสนเทศ สถาบันวิทยสิริเมธี",
        roles: ["Research Assistant"],
        count: 1,
        address: "555 หมู่ 1 ตำบลป่ายุบใน อำเภอวังจันทร์ จังหวัดระยอง 21210",
        imageUrl: "./img/Interfaces Lab สำนักวิชาวิทยาศาสตร์และเทคโนโลยีสารสนเทศ สถาบันวิทยสิริเมธี.webp"
    },
    {
        id: "2",
        name: "บริษัท เก็ตออน เทคโนโลยี จำกัด",
        roles: ["DevOps Engineer(1)", "Business Analyst(1)"],
        count: 2,
        address: "9/196 ซอยรัชประชา 4 ถนนรัชดาภิเษก แขวงจตุจักร เขตจตุจักร กรุงเทพมหานคร 10900",
        imageUrl: "./img/บริษัท เก็ตออน เทคโนโลยี จำกัด.jpeg"
    },
    {
        id: "3",
        name: "บริษัท โค้ดฮาร์ด จำกัด",
        roles: ["Developer(1)", "UX/UI Designer(1)", "DevOps Engineer(1)", "Business Analyst(1)"],
        count: 4,
        address: "57/25 หมู่ที่ 9 ตำบลบางพูด อำเภอปากเกร็ด จังหวัดนนทบุรี 11120",
        imageUrl: "./img/บริษัท โค้ดฮาร์ด จำกัด.webp"
    },
    {
        id: "4",
        name: "สำนักงานเทศบาลนครรังสิต",
        roles: ["Software Developer"],
        count: 2,
        address: "57/25 หมู่ที่ 9 ตำบลบางพูด อำเภอปากเกร็ด จังหวัดนนทบุรี 11120",
        imageUrl: "./img/สำนักงานเทศบาลนครรังสิต.webp"
    },
    {
        id: "5",
        name: "บริษัท บานาน่า โคดดิ้ง จำกัด",
        roles: ["Developer"],
        count: 1,
        address: "34/12 หมู่ 5 ถนนคลองชลประทาน ตำบลสุเทพ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50200",
        imageUrl: "./img/บริษัท บานาน่า โคดดิ้ง จำกัด.jpg"
    },
    {
        id: "6",
        name: "บริษัท เด็นโซ่ (ประเทศไทย) จำกัด",
        roles: ["Fullstack Developer"],
        count: 1,
        address: "369 หมู่ 3 ถนนเทพารักษ์ ตำบลเทพารักษ์ อำเภอเมืองสมุทรปราการ จังหวัดสมุทรปราการ 10270",
        imageUrl: "./img/บริษัท เด็นโซ่ (ประเทศไทย) จำกัด.jpg"
    },
    {
        id: "7",
        name: "บริษัท มัลเบอร์รี่ ซอฟต์",
        roles: ["Business Analyst(1)", "UX/UI Designer(1)"],
        count: 2,
        address: "204/229 หมู่บ้านนันท์นรินทร์ หมู่ที่ 1 ถนนนาวงประชาพัฒนา ตำบลหลักหก อำเภอเมืองปทุมธานี จังหวัดปทุมธานี 12000",
        imageUrl: "./img/บริษัท มัลเบอร์รี่ ซอฟต์.png"
    },
    {
        id: "8",
        name: "บริษัท เวบปาค จํากัด",
        roles: ["Software Developer"],
        count: 1,
        address: "525/89 ซอยลาดพร้าว 126 แขวงพลับพลา เขตวังทองหลาง กรุงเทพมหานคร 10310",
        imageUrl: "./img/บริษัท เวบปาร์คจำกัด.webp"
    },
    {
        id: "9",
        name: "บริษัท ดูดี อินดีด คอร์ปอเรชั่น จำกัด",
        roles: ["Fullstack Developer(1)", "UX/UI Designer(1)", "QA/Tester(1)"],
        count: 3,
        address: "89 ถนนชลประทาน ตำบลสุเทพ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50200",
        imageUrl: "./img/บริษัท ดูดี อินดีด คอร์ปอเรชั่น จำกัด.jpg"
    },
    {
        id: "10",
        name: "บริษัท จับจ่าย คอร์ปอเรชั่น จำกัด",
        roles: ["Fullstack Developer"],
        count: 1,
        address: "708/13 ซอยจรัญสนิทวงศ์ 3 ถนนจรัญสนิทวงศ์ แขวงวัดท่าพระ เขตบางกอกใหญ่ กรุงเทพมหานคร 10600",
        imageUrl: "./img/บริษัท จับจ่าย คอร์ปอเรชั่น จำกัด.webp"
    },
    {
        id: "11",
        name: "บริษัท เดฟ ฟอร์เวิร์ด จำกัด",
        roles: ["Fullstack Developer"],
        count: 2,
        address: "99/61 หมู่ที่ 22 ตำบลบางพลีใหญ่ อำเภอบางพลี จังหวัดสมุทรปราการ 10540",
        imageUrl: "./img/บริษัท เดฟ ฟอร์เวิร์ด จำกัด.webp"
    },
    {
        id: "12",
        name: "บริษัท โทรคมนาคมแห่งชาติ จำกัด (มหาชน)",
        roles: ["Developer(1)", "Software Developer(1)"],
        count: 2,
        address: "99 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพมหานคร 10210",
        imageUrl: "./img/บริษัท โทรคมนาคมแห่งชาติ จำกัด (มหาชน).webp"
    },
    {
        id: "13",
        name: "บริษัท โคเดียม จำกัด",
        roles: ["Software Tester"],
        count: 1,
        address: "865 ชั้น 7 ถนนพระราม 1 แขวงวังใหม่ เขตปทุมวัน กรุงเทพมหานคร 10330",
        imageUrl: "./img/บริษัท เดฟ ฟอร์เวิร์ด จำกัด.webp"
    },
    {
        id: "14",
        name: "บริษัท มิราธารา จำกัด",
        roles: ["Software Developer"],
        count: 1,
        address: "555 อาคารรสา ทาวเวอร์ 2 ชั้น 23 ห้อง 2303, 2304-2 ถนนพหลโยธิน แขวงจตุจักร เขตจตุจักร กรุงเทพมหานคร 10900",
        imageUrl: "./img/บริษัท มิราธารา จำกัด.webp"
    },
    {
        id: "15",
        name: "บริษัท จีเอเบิล จำกัด (มหาชน)",
        roles: ["Frontend Developer"],
        count: 1,
        address: "127/30 อาคารปัญจธานี ชั้น 25 ถนนนนทรี แขวงช่องนนทรี เขตยานนาวา กรุงเทพมหานคร 10120",
        imageUrl: "./img/บริษัท จีเอเบิล จำกัด (มหาชน).png"
    },
    {
        id: "16",
        name: "บริษัท ออคตากอน อินเทอร์แอคทีฟ จำกัด",
        roles: ["UX/UI Designer"],
        count: 1,
        address: "919/541 ห้อง B ชั้น 49 อาคารจิวเวลรี่เทรดเซ็นเตอร์ ถนนสีลม แขวงสีลม เขตบางรัก กรุงเทพมหานคร 10500",
        imageUrl: "./img/บริษัท ออคตากอน อินเทอร์แอคทีฟ จำกัด.webp"
    },
    {
        id: "17",
        name: "บริษัท ไปด้วยกันมั๊ย จำกัด",
        roles: ["Software Tester(1)", "Fullstack Developer(1)"],
        count: 2,
        address: "217 หมู่ที่ 4 ตำบลแม่เหียะ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50100",
        imageUrl: "./img/บริษัท ไปด้วยกันมั๊ย จำกัด.jpg"
    },
    {
        id: "18",
        name: "บริษัท ปรานต์เวิร์คส์ จำกัด",
        roles: ["Quality Analyst"],
        count: 1,
        address: "110/3 หมู่ที่ 5 ตำบลสุเทพ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50200",
        imageUrl: "./img/บริษัท ปรานต์เวิร์คส์ จำกัด.jpg"
    },
    {
        id: "19",
        name: "บริษัท ฟูจิคูระ อิเล็กทรอนิกส์ คอมโพเน้นส์ (ประเทศไทย) จํากัด",
        roles: ["Software Engineer"],
        count: 3,
        address: "323 อาคารยูไนเต็ดเซ็นเตอร์ ชั้น 28 ถนนสีลม แขวงสีลม เขตบางรัก กรุงเทพมหานคร 10500",
        imageUrl: "./img/บริษัท ฟูจิคูระ อิเล็กทรอนิกส์ คอมโพเน้นส์ (ประเทศไทย) จํากัด.jpg"
    },
    {
        id: "20",
        name: "บริษัท ไฮเออร์ ควอลิตี้ ซอฟต์แวร์ จำกัด",
        roles: ["QA/Tester"],
        count: 1,
        address: "35/22 หมู่บ้านบ้านชัยพฤกษ์ หมู่ที่ 7 ตำบลหนองหอย อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50000",
        imageUrl: "./img/บริษัท ไฮเออร์ ควอลิตี้ ซอฟต์แวร์ จำกัด.jpg"
    }
];
//# sourceMappingURL=mockData.js.map